Revit 2027 API
NurbsSurfaceData.GetNumberOfKnotsV Method
 Get the number of knots in the v-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfKnotsV()
Public Function GetNumberOfKnotsV As Integer
public:
int GetNumberOfKnotsV()
member GetNumberOfKnotsV : unit -> int
Return Value
Int32
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace